In [1]:
import pandas as pd

In [2]:
friend_dict_list = [
    {'name': 'John', 'age': 25, 'job': 'student'},
    {'name': 'Nate', 'age': 30, 'job': 'teacher'},
]

In [3]:
df = pd.DataFrame(friend_dict_list)

In [4]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [5]:
df = df[['name', 'age', 'job']]

In [6]:
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [8]:
from collections import OrderedDict

In [9]:
friend_ordered_dict = OrderedDict(
    [
        ('name', ['John', 'Nate']),
        ('age', [25, 30]),
        ('job', ['student', 'teacher'])
    ]
)

In [10]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [13]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [14]:
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']
]

In [15]:
column_name = ['name', 'age', 'job']

In [16]:
df = pd.DataFrame.from_records(friend_list, columns=column_name)

In [18]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [19]:
friend_list = [
    ['name', ['John', 'Nate']],
    ['age', [20, 30]],
    ['job', ['student', 'teacher']]
]

In [20]:
df = pd.DataFrame.from_items(friend_list)

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

In [21]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher